In [1]:
import numpy as np
import pandas as pd

In [2]:
# declare movie rating dataframe : ratings from 1 to 5 (star * rating)
df_movie_rating = pd.DataFrame(
        
    {"movie_1":[5,4,3,3,2,1],
    "movie_2":[4,5,2,3,4,2]},
    index=["Tom","Jeff","Peter","Ram","Ted","Paul"]
        
)

In [3]:
df_movie_rating

       movie_1  movie_2
Tom          5        4
Jeff         4        5
Peter        3        2
Ram          3        3
Ted          2        4
Paul         1        2

In [4]:
def movie_grade(rating):
    if rating==5:
        return "A"
    if rating==4:
        return "B"
    if rating==3:
        return "C"
    else:
        return "F"

In [5]:
print(movie_grade(5))

A

In [6]:
df_movie_rating.applymap(movie_grade)

      movie_1 movie_2
Tom         A       B
Jeff        B       A
Peter       C       F
Ram         C       C
Ted         F       B
Paul        F       F

## Data Operation with Satistical Functions

In [8]:
df_test_scores = pd.DataFrame(
            
    {"Test1":[95,84,73,88,82,61],
    "Test2":[74,85,82,73,77,79]},
    index=["Jack","Lewis","Patrick","Rich","Kelly","Paula"]
)

In [9]:
# Check max score
df_test_scores.max()

Test1    95
Test2    85
dtype: int64

In [11]:
# Check mean score
df_test_scores.mean()

Test1    80.500000
Test2    78.333333
dtype: float64

In [12]:
df_test_scores.std()

Test1    11.979149
Test2     4.633213
dtype: float64

## data operation using Groupby

In [13]:
df_president_name = pd.DataFrame({"first":["George","Bill","Ronald","Jimmy","George"],
                                 "last":["Bush","Clinton","Regon","Carter","Washington"]})

In [14]:
df_president_name

    first        last
0  George        Bush
1    Bill     Clinton
2  Ronald       Regon
3   Jimmy      Carter
4  George  Washington

In [15]:
grouped = df_president_name.groupby("first")

In [17]:
grouped_data = grouped.get_group("George")

In [18]:
grouped_data

    first        last
0  George        Bush
4  George  Washington

## Data Operation - Sorting

In [19]:
df_president_name.sort_values("first")

    first        last
1    Bill     Clinton
0  George        Bush
4  George  Washington
3   Jimmy      Carter
2  Ronald       Regon

In [20]:
df_president_name.sort_values("last")

    first        last
0  George        Bush
3   Jimmy      Carter
1    Bill     Clinton
2  Ronald       Regon
4  George  Washington

## Data Standardization

In [25]:
def standardize_tests(test):
    return (test-test.mean())/test.std()

In [26]:
standardize_tests(df_test_scores["Test1"])

Jack       1.210437
Lewis      0.292174
Patrick   -0.626088
Rich       0.626088
Kelly      0.125218
Paula     -1.627829
Name: Test1, dtype: float64

In [28]:
df_test_scores["Test1"].std()

11.979148550710939

In [29]:
def standardize_test_scores(dataframe):
    return dataframe.apply(standardize_tests)

In [30]:
standardize_test_scores(df_test_scores)

            Test1     Test2
Jack     1.210437 -0.935276
Lewis    0.292174  1.438886
Patrick -0.626088  0.791387
Rich     0.626088 -1.151109
Kelly    0.125218 -0.287777
Paula   -1.627829  0.143889